function depositCalc(input) {
 let depositSum = Number(input[0]);
 let depositPeriod = Number(input[1]);
 let annualInterestRate = Number(input[2]);

let totalSum = depositSum + depositPeriod * ((depositSum * (annualInterestRate/100)) / 12);

 console.log(totalSum);
}

depositCalc(["200 ","3","5.7"]);


// 3.	Калкулатор депозити
// Напишете програма, която изчислява каква сума ще получите в края на депозитния период при определен лихвен процент. Използвайте следната формула: 
// сума = депозирана сума  + срок на депозита * ((депозирана сума * годишен лихвен процент ) / 12)
// Вход
// От конзолата се четат 3 реда:
// 1.	Депозирана сума – реално число в интервала [100.00 … 10000.00]
// 2.	Срок на депозита (в месеци) – цяло число в интервала [1…12]
// 3.	Годишен лихвен процент – реално число в интервала [0.00 …100.00]
// Изход
// Да се отпечата на конзолата сумата в края на срока.
