function multiplyBy2(input) {
    let i = 0;

    for (i = 0; i < input.length - 1; i++) {
        if(input[i] >= 0) {
        result = input[i] * 2;
        }     
        console.log(`Result: ${result.toFixed(2)}`);
                
    }
    console.log("Negative number!");
  
}

multiplyBy2([-123]);

// Напишете програма, която да умножава положителни числа по 2. От конзолата се четат поредица от реални числа, всяко на нов ред, докато не се въведе отрицателно. След всяко умножено число на нов ред да се отпечата "Result: {резултата от умножението}". Резултата от умножението да бъде форматиран до втория знак след десетичния разделител. При получаване на негативно число, на конзолата да се отпечата "Negative number!" и програмата да приключи изпълнение.
