function histogram(input) {
    let n = Number(input[0]);

    let p1count = 0;
    let p2count = 0;
    let p3count = 0;
    let p4count = 0;
    let p5count = 0;

    let p1Percent = 0;
    let p2Percent = 0;
    let p3Percent = 0;
    let p4Percent = 0;
    let p5Percent = 0;

    for(let i = 1; i <= input.length; i++) {
        if(Number(input[i]) < 200) {
            p1count += 1;
            p1Percent = (p1count / n) * 100;
            
        }else if(Number(input[i]) >= 200 && Number(input[i]) <= 399) {
            p2count += 1;
            p2Percent = (p2count / n) * 100;

        }else if(Number(input[i]) >= 400 && Number(input[i]) <= 599) {
            p3count +=1;
            p3Percent = (p3count / n) * 100;

        }else if(Number(input[i]) >= 600 && Number(input[i]) <= 799) {
            p4count +=1;
            p4Percent = (p4count / n) * 100;

        }else if (Number(input[i]) >= 800){
            p5count +=1;
            p5Percent = (p5count / n) * 100;
        }
    }

    console.log(`${p1Percent.toFixed(2)}%`);
    console.log(`${p2Percent.toFixed(2)}%`);
    console.log(`${p3Percent.toFixed(2)}%`);
    console.log(`${p4Percent.toFixed(2)}%`);
    console.log(`${p5Percent.toFixed(2)}%`);
}

histogram(["14", "53", "7", "56", "180", "450", "920", "12", "7", "150", "250", "680", "2", "600", "200"]);


// Дадени са n цели числа в интервала [1…1000]. От тях някакъв процент p1 са под 200, друг процент p2 са от 200 до 399, друг процент p3 са от 400 до 599, друг процент p4 са от 600 до 799 и останалите p5 процента са от 800 нагоре. Да се напише програма, която изчислява и отпечатва процентите p1, p2, p3, p4 и p5.
// Пример: имаме n = 20 числа: 53, 7, 56, 180, 450, 920, 12, 7, 150, 250, 680, 2, 600, 200, 800, 799, 199, 46, 128, 65. Получаваме следното разпределение и визуализация:
// Диапазон	Числа в диапазона	Брой числа	Процент
// < 200	    53, 7, 56, 180, 12, 7, 150, 2, 199, 46, 128, 65	12	p1 = 12 / 20 * 100 = 60.00%
// 200 … 399	250, 200	2	p2 = 2 / 20 * 100 = 10.00%
// 400 … 599	450	1	p3 = 1 / 20 * 100 = 5.00%
// 600 … 799	680, 600, 799	3	p4 = 3 / 20 * 100 = 15.00%
// ≥ 800	    920, 800	2	p5 = 2 / 20 * 100 = 10.00%
// Вход
// На първия ред от входа стои цялото число n (1 ≤ n ≤ 1000) – брой числа. На следващите n реда стои по едно цяло число в интервала [1…1000] – числата върху които да бъде изчислена хистограмата.
// Изход
// Да се отпечата на конзолата хистограмата – 5 реда, всеки от които съдържа число между 0% и 100%, с точност две цифри след десетичната точка, например 25.00%, 66.67%, 57.14%.
