function building(input) {
    let floorsNumber = Number(input.shift());
    let roomsNumber = Number(input.shift());

    for(let floor = floorsNumber; floor >= 1; floor--) {
        
        let matrix = "";

        for(let room = 0; room <= roomsNumber; room++) {

            if(floor === floorsNumber) {
                if(roomsNumber > room) {
                    matrix += "L" + floor + room + " ";
                }
                
            }else if(floor % 2 === 0) {
                if(roomsNumber > room) {
                matrix += "O" + floor + room + " ";
                }
                
            }else{
                if(roomsNumber > room) {
                matrix += "A" + floor + room + " ";
                }
            }
            
        }
        console.log(matrix);
    }

}

building(["6", "4"]);

// Напишете функция, която извежда на конзолата номерата на стаите в една сграда (в низходящ ред), като са изпълнени следните условия:
// •	На всеки четен етаж има само офиси
// •	На всеки нечетен етаж има само апартаменти
// •	Всеки апартамент се означава по следния начин : А{номер на етажа}{номер на апартамента}, номерата на апартаментите започват от 0.
// •	Всеки офис се означава по следния начин : О{номер на етажа}{номер на офиса}, номерата на офисите също започват от 0.
// •	На последният етаж винаги има апартаменти и те са по-големи от останалите, за това пред номера им пише 'L', вместо 'А'. Ако има само един етаж, то има само големи апартаменти!
// Функцията получава масив от две цели числа - броят на етажите и броят на стаите за един етаж. 
