function movieTickets(input) {
    let a1 = Number(input[0]);
    let a2 = Number(input[1]);
    let n = Number(input[2]);

    let m = n / 2;

    let char1;
    let char2 = 0;
    let char3 = 0;

    let char1Num = 0;

    for(let i = a1; i <= a2 - 1; i++) {

        char1 = String.fromCharCode(i);

        for(let j = 1; j <= n-1; j++) {
            char2 = j;

            for(let k = 1; k <= m - 1; k++){

                char3 = k;

                char1Num = Number(char1.charCodeAt(0));
                if(char1Num % 2 !== 0 && ((char2 + char3 + char1Num) % 2 !== 0)) {
                    console.log(`${char1}-${char2}${char3}${char1Num}`);
                }
            }
        }
    }

}

movieTickets(["71", "74", "6"]);

// Трябва да напишете програма, която чете три цели числа  a1, a2, n въведени от потребителя и генерира номера за билети, които се състоят от следните 4 символа:
// •	Символ 1: символ с ASCII код от а1 до а2 - 1
// •	Символ 2: цифра от 1 до n - 1
// •	Символ 3: цифра от 1 до n / 2 - 1
// •	Символ 4: цифрова репрезентация (ASCII код) на символ 1
// След като са изпълнени условията се генерира следния билет:
// "{Символ 1}-{Символ 2}{Символ 3}{Символ  4}"
// Вход
// •	a1 – цяло число в интервала [65… 89]
// •	a2 – цяло число в интервала [66… 91]
// •	n – цяло число в интервала [1… 10]
// Изход
// На конзолата трябва да се отпечатат всички билетни номера, на които числовата репрезентация на символ 1 е нечетна и сборът на символ 2, символ 3 и символ 4 е нечетен.
