function footballTournament(input) {
    let teamName = input[0];
    let teamNumberOfGames = Number(input[1]);

    let w = 0;
    let d = 0;
    let l = 0;

    for(let i = 2; i < input.length; i++) {
        if(teamNumberOfGames === 0){
            
            break;
        }

        if(input[i] === "W") {
            w++;
        }else if(input[i] === "D") {
            d++;
        }else if(input[i] === "L") {
            l++;
        }
    }
    if(teamNumberOfGames > 0) {

   
    let totalPoints = (w * 3) + (d * 1) + (l * 0);
    console.log(`${teamName} has won ${totalPoints} points during this season.`);

    console.log("Total stats:");

    console.log(`## W: ${w}`);
    console.log(`## D: ${d}`);
    console.log(`## L: ${l}`);

    let rateOfWinGames = (w / teamNumberOfGames) * 100;
    console.log(`Win rate: ${rateOfWinGames.toFixed(2)}%`);

    }else {
        console.log(`${teamName} hasn\'t played any games during this season.`);
    }
}

footballTournament(["Barcelona",
                    "7",
                    "W",
                    "D",
                    "L",
                    "L",
                    "W",
                    "W",
                    "D"]);

// Задачата ви е да напишете програма, която приема името на отбор и прави статистика за него. През един сезон всеки отбор изиграва определен брой футболни срещи, като за всяка среща на отбора се дават точки в зависимост от изхода от срещата. Има три възможни изхода от една среща:
// 	W - Отборът е победител и получава 3 точки
// 	D - Срещата е завършила без победител и отборът получава 1 точка
// 	L - Отборът е загубил срещата и не получава точки
// Напишете програма, която приема името на футболен отбор и извежда неговата статистика, на база на изиграните срещи през този сезон. Неговата статистика трябва да включва общия брой спечелени точки през настоящия сезон, подробна статистика за изхода на изиграните игри и процент победи през сезона. Ако отборът по някаква причина не е играл мачове през настоящия сезон се извежда специално съобщение.
// Вход
// От конзолата се четат два реда:
// •	Името на футболния отбор, за който водим статистика - текст
// •	Броя изиграни срещи през настоящия сезон - цяло число в интервала [0… 100]
//  За всяка изиграна среща се прочита отделен ред:
// o	Резултатът от изиграната среща в един от горепосочените формати – символ с възможности 'W', 'D' и 'L'
// Изход
// В зависимост от това дали отборът е играл мачове през настоящия сезон се извеждат два вида изход.
// •	Ако отборът не е изиграл нито един мач през настоящия сезон се извежда точно един ред в следния формат:
// o	"{името на отбора} hasn't played any games during this season."
// •	Ако отборът е изиграл един мач или повече се извеждат шест реда в следния формат:
// o	"{името на отбора} has won {брой спечелени точки} points during this season"
// o	"Total stats:"
// o	"## W: {брой спечелени игри}"
// o	"## D: {брой игри, завършили наравно}" 
// o	"## L: {брой загубени игри}" 
// o	"Win rate: {процент спечелени игри}%"
// Процентът спечелени игри трябва да бъде форматиран до втората цифра след десетичния знак.
