function highJump(input) {
    let index = 1;
    let wantedHeigth = Number(input[0]);

    let jumps = 0;
    let target = wantedHeigth - 30;

    let jumpResult = 0;
    let attempts = 0;

    while (target <= wantedHeigth) {
        jumpResult = Number(input[index]);

        if (jumpResult > target) {
            target += 5;
            attempts = 0;

        } else {
            attempts++;
        }

        jumps++;

        if (attempts === 3) {
            break;
        }

        index++;

    }

    if (attempts === 3) {
        console.log(`Tihomir failed at ${target}cm after ${jumps} jumps.`);

    } else {
        console.log(`Tihomir succeeded, he jumped over ${wantedHeigth}cm after ${jumps} jumps.`);
    }
}

highJump(["231",
"205",
"212",
"213",
"228",
"229",
"230",
"235"]);

// Българският лекоатлет Тихомир Иванов започва тренировки за предстоящото европейско първенство по лека атлетика на закрито в Глазгоу, Шотландия.
// Вашата задача е да напишете софтуер, с който Иванов да следи своя прогрес и дали е достигнал желаните резултати. В началото програмата получава желаната височина на летвата от Тихомир, той започва тренировката си като поставя летвата на височина 30см по-ниско от целта. За всяка височина той има право на 3 скока, като за да бъде един скок успешен, той трябва да бъде над височината на летвата. При успешен скок (над летвата), височината й се вдига с 5 сантиметра. При три неуспешни скока на една и съща височина, тренировката приключва с неуспех. При достигане на желаната височина и нейното успешно прескачане, тренировката приключва с успех.
// Вход
// Входът е поредица от цели числа в интервала [100…300]:
// •	На първия ред се прочита желаната от Тихомир Иванов височина в сантиметри
// •	На всеки следващ ред до приключване на програмата се прочита височината от скока на Иванов 
// Изход
// На конзолата трябва да се отпечата един ред:
// •	Ако Тихомир не успее да преодолее желаната височина:
// o	"Tihomir failed at {височина на летвата към момента на провала}cm after {брой скокове от началото на тренировката} jumps."
// •	Ако Тихомир успее да преодолее височината:
// o	"Tihomir succeeded, he jumped over {височина на прескочената последно летва}cm after {брой скокове за цялата тренировка} jumps."
